INSERT INTO types VALUES
(1, 'Куплю'),
(2, 'Продам');

INSERT INTO pictures VALUES
(1, 'item', 'item01.jpg', 'item01@2x.jpg'),
(2, 'item', 'item02.jpg', 'item02@2x.jpg'),
(3, 'item', 'item03.jpg', 'item03@2x.jpg'),
(4, 'item', 'item04.jpg', 'item04@2x.jpg'),
(5, 'item', 'item05.jpg', 'item05@2x.jpg'),
(6, 'category', 'cat01.jpg', 'cat01@2x.jpg'),
(7, 'category', 'cat02.jpg', 'cat02@2x.jpg'),
(8, 'category', 'cat03.jpg', 'cat03@2x.jpg'),
(9, 'category', 'cat04.jpg', 'cat04@2x.jpg'),
(10, 'category', 'cat05.jpg', 'cat05@2x.jpg'),
(11, 'avatar', 'avatar01.jpg', 'avatar01@2x.jpg'),
(12, 'avatar', 'avatar02.jpg', 'avatar02@2x.jpg'),
(13, 'avatar', 'avatar03.jpg', 'avatar03@2x.jpg'),
(14, 'avatar', 'avatar04.jpg', 'avatar04@2x.jpg');

INSERT INTO authors VALUES
(1, 'Иван', 'Подлесный', 'podlesniy_i@local.com', 'qwerty123', 14),
(2, 'Михаил', 'Абрамов', 'abramov_m@local.com', 'ytrewq111', 12),
(3, 'Антон', 'Маркин', 'anton_markin@local.com', 'asdfgh456', 13),
(4, 'Анастасия', 'Зинченко', 'zinchenko_a@local.com', 'zxcvbn098', 11);

INSERT INTO categories VALUES
(1, 6, 'Книги'),
(2, 7, 'Разное'),
(3, 8, 'Посуда'),
(4, 6, 'Игры'),
(5, 6, 'Животные'),
(6, 6, 'Журналы');

INSERT INTO offers VALUES
(1, 1, 1, 1, '2019-01-01', 'книги Стивена Кинга', 'Товар в отличном состоянии. Пользовались бережно и только по большим праздникам. Продаю с болью в сердце...', 2000),
(2, 2, 2, 2, '2019-02-03', 'поддержанный портфель', 'Даю недельную гарантию. Если товар не понравится — верну всё до последней копейки. Это настоящая находка для коллекционера!', 5234),
(3, 3, 1, 3, '2019-04-05', 'наручные часы', 'Если найдёте дешевле — сброшу цену. Таких предложений больше нет!', 8340),
(4, 4, 2, 4, '2020-04-12', 'антиквариат', 'Пользовались бережно и только по большим праздникам. Даю недельную гарантию.', 24600);

INSERT INTO offers_categories VALUES
(1, 1),
(1, 2),
(1, 6),
(2, 1),
(2, 3),
(3, 2),
(3, 5),
(3, 6),
(3, 3);

INSERT INTO comments VALUES
(1, 1, 1, '2019-01-01', 'Оплата наличными или перевод на карту?'),
(2, 2, 1, '2019-01-01', 'С чем связана продажа?'),
(3, 2, 1, '2019-01-01', 'Неплохо, но дорого.'),
(4, 1, 2, '2019-01-01', 'Почему так дешёво?'),
(5, 2, 2, '2019-01-01', 'Почему в таком ужасном состоянии?'),
(6, 3, 2, '2019-01-01', 'Вы что?!'),
(7, 4, 3, '2019-01-01', 'В магазине дешевле.'),
(8, 4, 4, '2019-01-01', 'А сколько игр в комплекте?');
